# Missing Data

### For drop use -> .Dropna() **Imp- we Drop in rows wise.
### For search -> .isna() **Imp- we Search as column Wise. 
### For fill -> .fillna() **Imp- Filling as Column wise.

In [1]:
import numpy as np 
import pandas as pd

In [2]:
data = {
    'A': [1, 2, np.nan, 4, 5],  # np.nan means none data 
    'B': [np.nan,2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, 5],
    'D': [1, np.nan, np.nan, np.nan, 5],
}
df = pd.DataFrame(data)

In [3]:
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  5.0  5.0

In [ ]:
# To finding none Valuse we use (isna)
df.isna() # True for none values & False for having values

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False  False  False

In [5]:
# here we can found in which column has total no. of none values.
df.isna().sum()

A    1
B    1
C    1
D    3
dtype: int64

In [6]:
df.isna().any() # By using (any) we command is there any empty value are there?

A    True
B    True
C    True
D    True
dtype: bool

**Removing Missing Value

Make sure that it's work on the rows

In [ ]:
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  5.0  5.0

In [8]:
df.dropna() # It's drop all value where NaN founds.

     A    B    C    D
4  5.0  5.0  5.0  5.0

In [9]:
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  5.0  5.0

In [13]:
# This Threshold function(thresh=) tell drop values except given no. available. 
df.dropna(thresh=3) # this thresh=3 tells print that row where atleast 3 values are notnull.

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
4  5.0  5.0  5.0  5.0

Filling the Missing Data

In [14]:
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  5.0  5.0

In [15]:
df.fillna(0)

     A    B    C    D
0  1.0  0.0  1.0  1.0
1  2.0  2.0  2.0  0.0
2  0.0  3.0  3.0  0.0
3  4.0  4.0  0.0  0.0
4  5.0  5.0  5.0  5.0

In [16]:
values = {'A': 4, 'B': 5, 'C': 7, 'D': 8}
df.fillna(values)

     A    B    C    D
0  1.0  5.0  1.0  1.0
1  2.0  2.0  2.0  8.0
2  4.0  3.0  3.0  8.0
3  4.0  4.0  7.0  8.0
4  5.0  5.0  5.0  5.0